#include "bsp_crc8.h"



/**********************************************************************************
  * @brief  对数据进行CRC值运算
  * @param  len--数据长度；
	          buf--数据内容
  * @retval CRC值
 *********************************************************************************/
uint8_t CRC8_Check(uint8_t len,const uint8_t *buf)
{
  uint8_t mm,crc=0,i=0,j=0;
  for(i = 0 ; i < len - 3; i ++)
  {
    mm = buf[i+3]; 
    for(j = 0 ; j < 8; j ++)
    {     
      if(((crc^mm)&0x01) == 0 )
      {
        crc >>=1;
      }
      else
      {
        crc^= 0x18;
        crc >>=1;
        crc |=0x80;
      }
      mm >>=1;
    }
  }
  return crc ;
}





/*******************************END*********************************/
